<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'שם',
    'column.guard_name' => 'מגן',
    'column.team' => 'צוות',
    'column.roles' => 'תפקידים',
    'column.permissions' => 'הרשאות',
    'column.updated_at' => 'עודכן ב',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'שם',
    'field.guard_name' => 'שם המגן',
    'field.permissions' => 'הרשאות',
    'field.team' => 'צוות',
    'field.team.placeholder' => 'בחר צוות ...',
    'field.select_all.name' => 'בחר הכל',
    'field.select_all.message' => 'מאפשר/מבטל את כל ההרשאות עבור תפקיד זה',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'ניהול הרשאות',
    'nav.role.label' => 'תפקידים',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'תפקיד',
    'resource.label.roles' => 'תפקידים',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'יישויות',
    'resources' => 'משאבים',
    'widgets' => 'וידג\'טים',
    'pages' => 'דפים',
    'custom' => 'הרשאות מותאמות',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'גישה אסורה',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'צפייה',
        'view_any' => 'צפייה בכל',
        'create' => 'יצירה',
        'update' => 'עדכון',
        'delete' => 'מחיקה',
        'delete_any' => 'מחיקה של כל',
        'force_delete' => 'מחיקה כפויה',
        'force_delete_any' => 'מחיקה כפויה של כל',
        'restore' => 'שחזור',
        'reorder' => 'סידור מחדש',
        'restore_any' => 'שחזור של כל',
        'replicate' => 'שכפול',
    ],
];
